# Pandas Join() Method
DataFrame Join is a convenient method for combining
the columns of two potentially differently-indexed

In [2]:
import pandas as pd

In [3]:
df1=pd.DataFrame({'A':[1,2,3],
                 'B':[10,20,30]},index=['a','b','c'])
df2=pd.DataFrame({'C':[4,5],
                 'D':[40,50]},index=['a','b'])
display(df1,df2)

   A   B
a  1  10
b  2  20
c  3  30

   C   D
a  4  40
b  5  50

In [4]:
df1.join(df2)

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [5]:
df1.join(df2,how='right')

   A   B  C   D
a  1  10  4  40
b  2  20  5  50

In [6]:
df1.join(df2,how='outer')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN

In [7]:
df3=pd.DataFrame({'A':[1,2,3],
                 'B':[10,20,30]},index=['a','b','c'])
df4=pd.DataFrame({'A':[4,5],
                 'D':[40,50]},index=['a','b'])
display(df3,df4)

   A   B
a  1  10
b  2  20
c  3  30

   A   D
a  4  40
b  5  50

In [10]:
df3.join(df4,lsuffix='_1')

   A_1   B    A     D
a    1  10  4.0  40.0
b    2  20  5.0  50.0
c    3  30  NaN   NaN

In [11]:
df1.join(df2,rsuffix='_1')

   A   B    C     D
a  1  10  4.0  40.0
b  2  20  5.0  50.0
c  3  30  NaN   NaN